{
  "Early Life / Professional Journey": [
    "\"What's a weakness or blind spot you wish you had worked on earlier in your career?\"",
    "\"What was a pivotal moment or decision that significantly changed the direction of your career?\"",
    "\"Have you witnessed your own investment strategy evolve over time?\"",
    "\"What was the transition like for you when your company grew and you couldn't control every aspect of team positioning?\"",
    "\"Tell us about your childhood and what you did for fun.\"",
    "\"Did your home life affect your behavior or performance in school?\"",
    "\"What led you to college and specifically to the University of Miami?\"",
    "\"At what point during your time in Miami did you decide to start a business?\"",
    "\"What has the transition been like from the earliest stage of first meetings and checks to where you are today with both access and the types of people you're working with?\"",
    "\"What are the differences you see between the early stages and where you are now?\""
  ],
  "Questions/Advice to help founders": [
    "\"For those just starting their careers and beginning to meet VCs, what qualities should they aspire to in their partners?\"",
    "\"How do you recommend founders self-audit to find the right partners?\"",
    "\"How can you gather as many validation points as possible to convince yourself that you're on the right path?\"",
    "\"What has the transition been like from the earliest stage of first meetings and checks to where you are today with both access and the types of people you're working with?\"",
    "\"What are the red flags that founders often overlook, leading to a 'no' from investors?\"",
    "\"What's a weakness or blind spot you wish you had worked on earlier in your career?\"",
    "\"What traits or patterns have you noticed that differentiate good investments from great ones?\"",
    "\"What are some common mistakes that founders make during the fundraising process?\"",
    "\"What signals should early-stage founders look for to know they're ready for investment?\"",
    "\"What should founders do after they've had a successful meeting with a VC?\""
  ],
  "Questions/Advice to help VCs": [
    "\"For those just starting their careers and beginning to meet VCs, what qualities should they aspire to in their partners?\"",
    "\"How do you recommend founders self-audit to find the right partners?\"",
    "\"What are the red flags that founders often overlook, leading to a 'no' from investors?\"",
    "\"What do you think is needed to be a successful VC in today's world?\"",
    "\"What's a normal week like for you as a venture capitalist?\"",
    "\"What market trends are you excited about right now?\"",
    "\"How do you balance data-driven analysis with intuition in your investment decisions?\"",
    "\"What are some common mistakes that founders make during the fundraising process?\"",
    "\"How do you source new opportunities and what strategies have been most effective for you?\"",
    "\"What types of startups do you like to invest in and what size checks are typically the right fit for your fund?\""
  ],
  "Questions/Advice that pertains to Culturally Relevant Topics (ex: AI, Blockchain)": [
    "\"What concerns do you have about AI?\"",
    "\"Is AI dominating every conversation you're in?\"",
    "\"What does the future of technology look like to you?\"",
    "\"How can we invest in a future that takes into account current realities and what are the companies that will be built because of them?\"",
    "\"What problems do you foresee existing in 5, 10, and 15 years?\"",
    "\"What market trends are you excited about right now?\"",
    "\"How do you evaluate potential opportunities when everyone is focusing on AI?\"",
    "\"How do you foresee the future of venture capital evolving, especially in regards to AI?\"",
    "\"Is it an automatic no for you if a team isn't using AI in their product flow?\"",
    "\"What are you looking for in a fast-growing market and how can you assess a founder's capabilities in such a competitive environment?\""
  ],
  "Questions/Advice that pertains to methodologies/frameworks they utilize in their work": [
    "\"How do you recommend founders self-audit to find the right partners?\"",
    "\"How can you gather as many validation points as possible to convince yourself that you're on the right path?\"",
    "\"What are the red flags that founders often overlook, leading to a 'no' from investors?\"",
    "\"How do you balance data-driven analysis with intuition in your investment decisions?\"",
    "\"What are some common mistakes that founders make during the fundraising process?\"",
    "\"How do you source new opportunities and what strategies have been most effective for you?\"",
    "\"Have you witnessed your own investment strategy evolve over time?\"",
    "\"How do you develop a framework to evaluate startups?\"",
    "\"How are you able to assess if a company is using your investment efficiently?\"",
    "\"How did you build a framework that enabled you to get your first few investments and how can others apply this advice?\""
  ],
  "Questions/Advice that cannot easily be put into any of the buckets above, but you think is interesting and should be included": [
    "\"What has your experience been like in the last two weeks, especially for those who weren't in LA or part of it?\"",
    "\"In moments of crisis, how do you handle it to maintain your mental and physical health?\"",
    "\"Are you more of an inward, focused person or do you prefer to involve as many people as possible and organize things in the best way possible?\"",
    "\"What's a weakness or blind spot you wish you had worked on earlier in your career?\"",
    "\"What's on your mind that you think is important for people to consider or understand?\"",
    "\"Why is it important to have a positive first attitude in life?\"",
    "\"Is having a positive attitude natural to you or is it something you've developed over time?\"",
    "\"What's a normal week like for you as a venture capitalist?\"",
    "\"What's one thing you've learned about maintaining relationships over the years?\"",
    "\"Tell us about your childhood and what you did for fun.\""
  ]
}