{
  "Early Life / Professional Journey": [
    "\"Kevin, can you give us some background on your professional career?\"",
    "\"What was it like growing up in Tulsa?\"",
    "\"Where does your drive for success come from?\"",
    "\"When did you first become interested in finance?\"",
    "\"What led you to this point in your life?\"",
    "\"How did you know when you were ready to start your own venture?\"",
    "\"What were some of the struggles you faced after your education while trying to identify your career path?\"",
    "\"What were some of the lessons that you learned as a child that have helped you today?\"",
    "\"Could you let us know a little bit more about your cultural background and where you grew up?\"",
    "\"How did you leverage your civil engineering degree to then move into that Financial role?\""
  ],
  "Questions/Advice to help founders": [
    "\"What makes a good business?\"",
    "\"Who should someone who is raising a fund actually be talking to?\"",
    "\"Are there things that someone who's raising a first fund should consider compared to someone who may be on their second or third fund?\"",
    "\"How does a Founder know if they fit into Sarra Ventures' criteria?\"",
    "\"How does a Founder tap into functional experts in go-to-market hiring fundraising?\"",
    "\"Where did the idea for your company come from and how did you choose the name?\"",
    "\"When you were thinking about starting Sarak, how did you go about crafting your thesis to fit within the ecosystem?\"",
    "\"How can a Founder who's listening to this conversation get in touch with you?\"",
    "\"How did you know when you were ready to start your own venture?\"",
    "\"Can you explain a little bit more about what a VC does and how to help Founders?\""
  ],
  "Questions/Advice to help VCs": [
    "\"How does the transition from being a Federal Reserve to Venture work?\"",
    "\"What did your first role at the VC firm look like?\"",
    "\"How do institutional investors make decisions and how do they analyze fund managers?\"",
    "\"Who should someone who is raising a fund actually be talking to?\"",
    "\"Are there things that someone who's raising a first fund should consider compared to someone who may be on their second or third fund?\"",
    "\"How do you define criteria for the types of companies that you want to invest in?\"",
    "\"Is there pressure for GPs to deploy so that there isn't so much dry powder?\"",
    "\"How did you transition from being an LP to a GP?\"",
    "\"When you were thinking about starting Sarak, how did you go about crafting your thesis to fit within the ecosystem?\"",
    "\"What did you see missing in the capital stack and how did you think about differentiation?\""
  ],
  "Questions/Advice that pertains to Culturally Relevant Topics (ex: AI, Blockchain)": [
    "\"How are you thinking about AI in terms of specific verticals that you're interested in?\"",
    "\"How do you evaluate AI opportunities that come across your desk?\"",
    "\"How can I ask how you're using technology today?\"",
    "\"How do we as VCs integrate technology in our practice for finding LPs or finding Founders or building visibility among other VCs?\"",
    "\"How do you use technology to enable you to work faster and more efficiently?\"",
    "\"Can you speak a little bit more on the lack of diversity in the VC world and the lack of minority Founders getting investment opportunities?\"",
    "\"What trends do you see in venture capital in 2025 and beyond? And, you know, are you overly optimistic or bearish on it over these next this next decade?\"",
    "\"How do you actually determine if someone has streamlined operations?\"",
    "\"Are are you all seeing um any you know changes uh over the last 12 months in the fund terms and governance structures that LPs are looking for?\"",
    "\"What do you think allocators today should be doing differently in a market where there's literally so much change?\""
  ],
  "Questions/Advice that pertains to methodologies/frameworks they utilize in their work": [
    "\"How do institutional investors make decisions and how do they analyze fund managers?\"",
    "\"How do you define criteria for the types of companies that you want to invest in?\"",
    "\"How does a Founder tap into functional experts in go-to-market hiring fundraising?\"",
    "\"When you were thinking about starting Sarak, how did you go about crafting your thesis to fit within the ecosystem?\"",
    "\"What did you see missing in the capital stack and how did you think about differentiation?\"",
    "\"How do you evaluate AI opportunities that come across your desk?\"",
    "\"How did you develop frameworks around decision-making from investing in funds?\"",
    "\"How do LPs think about alignment with the prospective funds that they want to invest in?\"",
    "\"How do you decide which emerging managers to back?\"",
    "\"How do we as VCs integrate technology in our practice for finding LPs or finding Founders or building visibility among other VCs?\""
  ],
  "Questions/Advice that cannot easily be put into any of the buckets above, but you think is interesting and should be included": [
    "\"What makes a good business?\"",
    "\"Where does your drive for success come from?\"",
    "\"What are the other goals you're working on at the moment?\"",
    "\"How do you fight complacency?\"",
    "\"Where did the idea for your company come from and how did you choose the name?\"",
    "\"What are you reading right now?\"",
    "\"Looking back at your life, what are the things that you want your 64-year-old self to be proud of?\"",
    "\"If you were to build your dream house, what would it look like?\"",
    "\"What led you to this point in your life?\"",
    "\"How close have you ever been to getting hit by a bus?\""
  ]
}