{
  "jfFpkXrltwE": {
    "title": "The Keys To Becoming A Successful Founder with Laurent Grill",
    "channel": "Sean Goldfaden",
    "date": "2025-03-24",
    "questions": [
      "[\"What's that experience been like for you and for those that weren't in LA or didn't even get to like be a part of it what was kind of like the last week and a half two weeks like for you?\",",
      "\"In those moments for you, what's your sort of default to I'm in a crisis and this is how I handle it to get my like my head my mental my physical like what do you do in the like most in intense experiences like this?\",",
      "\"Are you Inward and insular of like you go into a room kind of music on Focus or are you more someone that likes to whiteboard it out and kind of bring others into the it's a it's for me it's always been immediately like how do I get as many people involved as possible and organize it in the best way possible?\",",
      "\"For those that are just leaving school just getting their very first check in the door and they're starting the process of meeting VCS, what are the qualities that Founders should aspire to partner with in VCS?\",",
      "\"How do you recommend that Founders self audit themselves so that they can find the right Partners?\",",
      "\"How do you get as many validation points as possible so that you can convince yourself that this is the right thing to do?\",",
      "\"What's it been like to transition from the earliest stage first meeting first check to now having like where you are today with both access and just the types of people you're working with?\"]",
      "1. Was it like how how is it feel to evolve through like you know again the the conversations are different when it's someone being like will you take a shot on me like no one else has versus like hey like this is our executive like once you're at least at today's series a it's a different um organiz it's like a different energy or at least I would imagine maybe it's not what is the what's the differences that you see between it's it's a Hu there's a huge difference but there's also a lot of similarities?",
      "2. What are the red flags at the one yard line that Founders often times are just blind spots they don't even realize that's the reason that they're getting a no when you're like talking to Founders and like most of the pieces of it look good on paper but there's something deep inside that's telling you like I don't think I want to move forward or I don't think we should have you found any patterns that tend to be like I made the right decision there or anything you can call out is like something for Founders to be aware of that you're watching you're noticing?",
      "3. What are you worried about with AI?",
      "4. What does that mean to you?",
      "5. Do you feel like you know I think it depends on the industry but is AI just like taking over every conversation you're in?",
      "6. What is the future of technology look like I think is a very big question yeah that I'm not nearly smart enough to answer do you care I mean I know you care about it but like is it like is there a means to that end of like or does it just you end up going into these like Circles of you know like does it even matter do you spend time thinking about that?",
      "7. What is a corporate Venture fund and why would someone in the prop Tech space like get value from being a part of your fund versus some name or some VC they've heard of that you know does all the big unicorns like what is so special about a corporate Venture fund that maybe you know people don't know about?",
      "[\"Why would you go with us over someone big?\", \"When you look back at your growth as a VC from Luma now to jll, what's a weakness or blind spot that you now see had you had worked on earlier in your career?\", \"Is there anything that you've learned that's really important about being a VC that you just really wish you had paid more attention to at the very beginning of your career?\", \"What do you think is needed in today's world to be a successful VC in today's world?\", \"What do you think is needed over these next 2 three years to stay on top of the game?\", \"Why is it difficult to start a new generalist investor and what's the misconception?\", \"What's so hard about getting it going or raising capital?\", \"What is the essence of what La Tech week was?\", \"Do you feel like it's good for the ecosystem of like again just like the awareness the top of funnel of it all or if it's sort of just like it brings a lot of people here?\", \"What's on your mind that you think is just like you know good for people to think about or consume?\", \"How can we invest in a future that is taking into account that these things are real and what are the companies that are going to be built because of them?\", \"What is the problem that's going to exist in 5, 10 and 15 years away?\"]"
    ]
  },
  "SYrykAGdi1E": {
    "title": "How to Pick the Right Investor with Jeff Bocan",
    "channel": "Sean Goldfaden",
    "date": "2025-05-05",
    "questions": [
      "1. Why is it important just in life to have a yes first attitude, to have a positive first attitude?",
      "2. What can people that maybe that doesn't come as natural to them understand that maybe they don't see?",
      "3. Is that something that came from your parents? And is that natural to you that it's always been that way or is it something that over time you're like this is how I want to do it and I want to pass this down to my family?",
      "4. What's a normal week like both for Jeff individually and you know, maybe for people that are like what the hell do venture capitalists do every week?",
      "5. What's one thing you've learned over the years about maintaining those sorts of relationships?",
      "6. What would your actual methodology be when it comes to those quick little pings or those frequency touch points?",
      "7. What market trends are you excited about right now, if any at all?",
      "8. How do you evaluate potential opportunity when like everyone's, oh, it's this and AI and it's this and AI and it's this and AI and like everyone's coming at you with that kind of this is my carrot and this, you know, it's like this is my I've got the these two things?",
      "9. In your opinion, is there a difference between the right way to do it and the wrong way to do it?",
      "10. What are you excited about these days? And does it fit within, you know, what you're currently doing or has that been an obstacle over time?",
      "11. When you kind of think about like your good investments versus your great ones or the ones that you are so excited about, is there traits that you've seen or are there patterns that you've seen that differentiate the good from the great not even the bad from the the bad, but you know in that kind of head-to-head arena?",
      "[\"How do you balance your datadriven analysis sort of that like show me the numbers, show like I I I'm a lo I'm an investor so I need to understand the logic of the data versus your intuition like I just I know it. I feel like this is where it's going. Has that ever been a challenge for you?\",",
      "\"Is that something that you think is a superpower of yours?\",",
      "\"What's the spread in in that um you know in that space of data versus intuition?\",",
      "\"Have you developed any sort of POV on that?\",",
      "\"And on the other side of the, you know, of the coin, when it comes to fundraising, what are some of the common mistakes that you see founders making?\",",
      "\"What are some of the easy lowhanging fruit things that you're like, man, if they would just get this part right, it would help them so much more along the way?\",",
      "\"What are some common mistakes that you see founders make during fundraising process?\",",
      "\"What does that mean to you?\",",
      "\"Once investors start probing like, 'Hey, well, let's check out your uh financial model. Like, how are you going to spend this three million bucks?' And they're like, 'Ah, I don't really have a model. We'll get back to you on that.' Um uh can I see some customer traction?\",",
      "\"Like, what's happening with with what you guys have done in the last 12 months?\",",
      "\"What are your non-negotiables?\",",
      "\"How would you describe to them like like how do you help someone spot that quality in themselves?\",",
      "\"Like you know, you care about it's your kid. you want him to understand. And so, how can you help someone spot that?\",",
      "\"And is there anything you think they can do or is it like you've just, you know, it's kind of like that's a personality trait that I've real I I don't want to work with, but in if you were to give advice to someone or you were to try to help them see that blind spot. Anything come to mind of like how you would help them understand why that's an issue and how they can maybe improve upon it?\",",
      "\"Now, switching the conversation over a little more towards the VC route and like more of like strategic, how do you source new opportunities?\",",
      "\"And have you found any strategies to be most effective?\",",
      "\"In your world, in your experience, what's been the best strategy for you and what advice do you have for others?\",",
      "\"When you look back on it all, what were some or a just pivotal moment for you?\",",
      "\"Like a pivotal moment or decision that then like significantly changed the direction or what you wanted to do?\",",
      "\"Was there one kind of fork in the road that like completely just changed the trajectory of like how your, you know, career turned out?\"]",
      "[\"Should I is this the right decision for me at that point?\", \"Have you witnessed your own investment strategy evolve over time or do you find that you know the steady beat of the drum the chop wood carry water mentality um has carried you well?\", \"Have you had to adjust how you strategically invest in companies?\", \"Whether it's how quickly you invest or how much time you spend on diligence or um just in general, have you found yourself having to evolve or do you feel, you know, um proud in the fact that you have really been able to stay true to like these are how this is how I do it here?\", \"Is there any weight to you?\", \"How do you foresee the future or like how do you foresee like the ongoing evolution of venture capital uh in regards to AI in regards to I you know remember being like the guy that was like oh thank god the creative industry is safe from AI you know and then it's like the first thing that comes out is like oh copywriter is gone you know creative strategist like no no problem like chat GBT can do everything and now you're seeing things like, oh, upload models, oh, take the data room and just toss it.\", \"When you like close your eyes and look out into the world of venture, do you see it changing and evolving rapidly and and how do you kind of see um your role evolving over time?\", \"How do you define success for yourself?\", \"What do you want your legacy to be amongst the founders that you invested in?\"]"
    ]
  },
  "haknOSuWFv4": {
    "title": "Sean Goldfaden, Founder &amp; CEO of CoEfficient Labs - Part 1 - Demo Day EP 019",
    "channel": "CoEfficient Labs",
    "date": "2019-11-30",
    "questions": [
      "[\"How is captaining a team or leading from the back similar to running your own business?\",",
      "\"How does that work in business where this company has grown over the past few years and you can't have as much will say control over the positioning of every team member every day?\",",
      "\"What does that transition been like for you?\",",
      "\"Shaun, tell us where you grew up and what you did for fun as a kid?\"]",
      "[\"$18 an hour that's more money than I've ever liked thought of in my life I want to check this place out?\", \"So do you you know on a day-to-day basis was all this stuff happening at home affecting how you were acting in school behaving in school keeping up with your work any any stuff like that?\", \"You didn't get a most likely to start a pyramid scheme or anything like that after the thought?\", \"But what are some other things that your teachers may have said about you when you were in high school?\", \"So what led you to will say college generally and then more specifically to the University of Miami?\", \"So you got to Miami you know you had your cousin your cousin Mike there so you had a great cheerleader sort of built in can you talk a little bit though because when I first met you I was sort of confused because you you were coming from London so what what was going on there hair how is it that you went from Marymount to London to Miami?\", \"At what point while living in Miami did you say okay yeah I'm going to school but now I need to start a business I want to have a business going on right now?\"]",
      "[\"Who is in this space who knows what they're talking about?\", \"What if I could go online and build my own Fedora?\", \"Where am I going to get the fedoras?\", \"What else could I do that maybe is kind of similar?\", \"How long did play ferret last and what happened?\", \"How long did you stay at insta canvas?\"]"
    ]
  },
  "4fSWeVVhJMI": {
    "title": "Why Most Founders Fail with Marlon Nichols",
    "channel": "Sean Goldfaden",
    "date": "2025-04-07",
    "questions": [
      "1. \"What was the most memorable part of that experience and that night?\"",
      "2. \"What do you think makes the LA startup ecosystem different than some of the other cities or some of the other tech hubs?\"",
      "3. \"What have you noticed over these last, you know, 5 10 years that you've been really invested in the community here?\"",
      "4. \"What do you want to see more of next year?\"",
      "5. \"What do you want to see for next year? Whether it's for your own event personally or just for the community at large, how do you want to continue to see LA Tech Week evolve over these next couple years?\"",
      "6. \"Could you spend just maybe a minute explaining to the audience that has never been to a culture house event or this is the first time maybe they're hearing about like what is culture house?\"",
      "7. \"Why is it important now to come back together again? And what, you know, where do you see that playing a role in in startup founders just growth in general?\"",
      "8. \"Maybe talk a little bit about MAC, you know, the types of startups you like to invest in and, you know, potentially like the size checks that typically are like the right fit for what you're what you guys are doing?\"",
      "9. \"When you have a, you know, founder, maybe they're even a little too early for Mac. they're too early for you and they come to you and they say, 'Hey, I have this really great idea, but I don't know if I should try to build the idea first and then try to raise money or if I should try to raise some money and then build the quote unquote idea or the product.' What do you say to them?\"",
      "[\"So in your opinion, what signals should early stage founders be thinking to themselves that let them know, okay, now I'm ready to go and get investment?\",",
      "\"But how important is that founder's long-term vision versus like, you know, where where we're at today pitching the VC?\",",
      "\"Do you like seeing a longer term vision like that?\",",
      "\"Do you think it's more important that founders are coming to you with a tighter, you know, one year, two year, three year map?\",",
      "\"Like where do you want to see the specifics of some founders's vision um in today's you know society?\",",
      "\"Um, how do you personally develop a framework to evaluate these sorts of startups?\",",
      "\"Like do have you over the years have a system in place?\",",
      "\"Is it change every time?\",",
      "\"Like how with all of the moving pieces that are, you know, constantly happening, how are you able to take all of these uncertainties into your own mindset and sort of parse them out?\",",
      "\"Do you have any sort of framework that you run founders through when you're investing them or thinking about investing in them?\",",
      "\"What are blind spots that you've maybe just seen from a distance that um high performers could be more aware of?\",",
      "\"Do you feel like the best leaders that you've seen can take that player on the field that's the wrong fit or not doing it right in in that way and then make them the best fit or get them to that place or do you think the best leaders realize it's not a fit out of the gate and they're just more about speed and making the decisions quickly?\",",
      "\"With AI being such a hot topic right now in 2025, is it a complete like automatic no if the teams now are not using AI in their product flow for you?\",",
      "\"Like if you meet a founder and they've got some solution but they don't have any AI as part of it are is your first response to them hey this looks great but like integrate AI and come back to me or are you still in a space where like there are companies that are still agnostic from AI and can still be very fundable companies for you?\",",
      "\"How are you able to assess if they're being efficient with your money?\",",
      "\"Like I can I can understand the idea of someone like wiring me or someone here's a million dollars, here's $5 million, but how do you actually know, oh yeah, they are either using my money efficiently or I should invest in them because they're using money efficiently?\"]",
      "[\"So, is your burn rate which where you said it was going to be at?\", \"Are you are you um uh spending the capital in the places where you said you were?\", \"If not, then you know why the shift, right?\", \"This also may be a very stupid question, but what should founders do right after they're done pitching you or after they've had a good meeting or something like you know the again think that they've just had their first VC meeting and they're like holy [ __ ] I think it went good.\", \"What's the next step for a founder in your opinion?\", \"Like what do you want to hear from?\", \"What do you want to see after a good meeting if anything at all?\", \"Are there any you know things that you're looking for in a fast growing market?\", \"Is there any way that you can assess a founders's capabilities knowing that there's so much competition?\", \"Is there anything that they can do in those instances to proactively address those risks?\", \"Is it just the way they talk and they vibe with you?\", \"Or is there a level of preparation or research that could be done?\", \"Like what is it do you think that they did?\", \"Is it just their knowledge of the space?\", \"Is it their preparation that they knew you were going to kind of go in that direction?\", \"How can how can founders that are in a busy space almost get ahead of it?\", \"So how did you kind of build a framework that enabled you to get your first one or two or five or 10 and how can other people take that kind of advice uh to heart for themselves?\", \"And so for someone that has no network, maybe they move from Africa to America or they whatever it might be, how can you how can one navigate the kind of ability to start to get mentors and start to get people like you're talking about without feeling like I'm just taking from them or I'm taking their time or like I'm just asking Marlin to make me intros and he doesn't even know who I am or there's no trust built.\", \"How can someone that doesn't have those people start to develop it in their 20s or their 30s so that 10 years down the road they have it?\", \"You know, do you have any suggestions for people that don't have a network and really they just they're just starting from ground ground zero?\", \"You know, even though they might be the right fit for you or like there's something about it, you end up passing it along.\", \"Is there, you know, anything that you've seen that, you know, ends up just not being a good fit for Mac or that, you know, you end up just uh passing along the the grapevine, if you will?\", \"Have has your due diligence process evolved over time like you know right during co it seemed like it was like you know a free-for-all like so many companies were getting invested and then after co we started to move into this recession and now it's like we're starting to come back.\", \"Like have you evolved your due diligence or has it been even more a reason to like stay in your kind of zone and not let all of the craziness interfere with your decision-m?\", \"Has there been an evolution with, you know, how funds have been evolving, startups have been evolving, AI, all of that?\", \"Any any change that you've seen in how you decide on what companies you want to invest in?\", \"And what have you found for yourself to help you know help your team succeed?\", \"Like what's required of a you know managing partner or the founder or like the head of a VC fund?\", \"What do you think is required today to support their junior team to really like help the whole fund evolve?\", \"What are some of the most common mistakes that new fund managers make in managing their LP relationships?\", \"like what are some blind spots that you've learned along the way now that maybe you wouldn't make that same mistake if you were a new fund manager now?\", \"Um 2025, January, end of the month here.\", \"Uh we're feels like things are moving quick already, but what what's got you most excited for this year?\"]"
    ]
  },
  "5wZRAqwt840": {
    "title": "Sean Goldfaden, Founder &amp; CEO of CoEfficient Labs - Part 2 - Demo Day EP 020",
    "channel": "CoEfficient Labs",
    "date": "2019-11-30",
    "questions": [
      "[\"What do you really want to talk to me about?\", \"Todd, you're kidding right?\", \"Matt, you can't do this to me like I love this so much how could you take this away?\", \"What did I do wrong?\", \"What does Steve Jobs have to do with this situation?\", \"In terms of creative circle, what was it about your time there that led you to start your own agency?\", \"What was the response like when you started telling people close to you that you were thinking about getting out of your day job and starting something completely new?\"]",
      "1. \"What were the first let's say year to like you know before you had an office when it was really you at an apartment at coffee shops by yourself at co-working spaces, what were those first couple years like?\"",
      "2. \"What was that journey like the simultaneously growing your business from scratch and then starting this relationship that would be so important to you personally but also so essential to the success of your business?\"",
      "3. \"So for other entrepreneurs out there who are building their business and find themselves working alongside the the person they love and want to spend the rest of their life with, can you synthesize for us what the most important thing to keep in mind is when you're working alongside your life partner every day?\"",
      "4. \"While we're talking about family and sort of the history of your family, the different illnesses and Jen, I wanted to talk about your brother Josh a little bit who I very sadly never got the chance to meet but you did share a short story collection of his with me while we were in college that I absolutely loved loved reading through, but I know that Josh was your sort of always an inspiration for you and continues to be so, could you just talk a little bit about that relationship with your brother?\"",
      "[\"If there's one part of Josh's personality either that you have or you wish had what would it be?\", \"So I need big changes in the last six months or things you're really excited for looking at the next little bit and the end of q4?\", \"If the previous 12 months involved the formation of the pod and sort of a rethinking of how you were going to offer services to startups what is the next 12 months having a store that you now that you kind of have a firmer idea of how exactly this machine runs?\", \"What's it been like having conversations on a weekly basis with top VCS and entrepreneurs?\", \"What are you most excited for in the coming months?\"]"
    ]
  },
  "ot0GREX_DxM": {
    "title": "#36: 2019 Growth Hacking Strategy with Sean Goldfaden of CoEfficient Labs",
    "channel": "CHANCEBENDING",
    "date": "2019-02-25",
    "questions": [
      "[\"Sean, you were part of one of the hottest growth firms here in Los Angeles, the rumor is you guys are building audience and and building revenue for startups across LA like you're almost like the I love this firm the series a whisper, can you confirm is that is that have you have you guys been called the the series a whispers?\",",
      "\"So what you're saying is there are startups out there they're in search of their next round of funding, they've probably taken in some funding and they need to hit a certain level of revenue or maybe users and that's when they call you?\",",
      "\"So, what you're saying is you guys help these startups, these larger companies expand their reach and start testing audiences that might be you know a little bit further away from that initial core audience, is that right?\",",
      "\"What exactly is growth hacking?\",",
      "\"How do you think about that like I I just think that for me personally I'm just I'm always striving to find something new and unique and that's becoming harder to do so so how do you as a professional how do you guys think about that as a business?\",",
      "\"Could you give us an example of where a pre-mortem helped you ahead of time?\"]",
      "[\"Can you guys give us an example of someone you blew up that that you killed it for?\", \"Do you do you have that?\", \"Do you have someone that you that you killed it for that you can talk about just maybe in broad strokes?\", \"So if my audience is out there and they're like wow coefficient labs Shawn and Steve are just you guys are killing it how should they start to think about if they're sitting there there they might have an idea they might be trying to get something off the ground like what's what's popping in 2019 like what are you guys thinking about like are there platforms are there are there things you're sort of looking at you're like wow I think this is happening right now?\", \"What are you guys thinking about like are there platforms are there are there things you're sort of looking at you're like wow I think this is happening right now?\"]",
      "[\"What's the key idea in principle?\", \"Do you have advice for people just on a really simple level?\", \"Where can people go and find out more about coefficient labs and where about you guys?\", \"What's your official title?\", \"I'm curious to know your thoughts on it so we have been kind of noodling around on what like the angle or what's the positioning for us like who do we want to speaking to you on our podcast and in our content in this world of companies and startups that are currently or thinking about or have already gone through the process of going through an accelerator program like Y Combinator mucker labs and the name of the podcast is demo day and the idea is that we would bring on members like yourself that have been through a program or that have been in the world of that in try to help founders prepare for in demystify this idea of demo day how they can set their campaigns up in that you know 12-week period leading up to it and really just kind of from the VCS perspective what's it like going through that process what's it like interviewing these um you know up-and-coming startups I'm curious to know your thoughts just on demo day I'm at in general I'm too niche or do you like where it's going?\"]"
    ]
  }
}