{
  "yxAx2VvCIfE": {
    "title": "An Uncharted Path to Venture Capital Founder | Kevin Moore, Serac Ventures",
    "channel": "Tesoro AI",
    "date": "2024-11-16",
    "questions": [
      "[\"Kevin, welcome to the show. Can you give us some background on your professional career?\", \"So how does that actually transition from being a Federal Reserve to Venture?\", \"And so that first role you had as a VC or at the VC firm, what did it look like?\", \"What did it look like that first role you had within BC?\", \"What makes a good business or is this a good business?\", \"Can you tell me more about your experience as an LP?\", \"How do institutional investors make decisions and how do they analyze fund managers?\"]",
      "[\"Who you should actually be talking to as someone who is raising a fund?\", \"What would you consider small in the world of VC?\", \"Are there things that someone who's raising a first fund should consider compared to someone who may be on that second or third fund?\", \"One other thing that I wanted to ask before we move on to sharak V you know thoughts on if you're raising your first fund thoughts on Fun Size right?\", \"How do you think about we talked earlier about defining criteria for the types of companies that you want to invest in and so maybe an easy way to ask this question is if I'm a Founder how do I know what's the criteria and how do I know if I fit into sarra Ventures criteria?\"]",
      "[\"Can you talk a little bit more about the kind of the expert side because I can imagine folks you know whether it's a first-time founder or they've had exits already right they may want to tap into some level of consultant who can help so functional experts in you said go to market hiring fundraising like how does a Founder actually kind of tap into how do they what does it look like to tap into that?\",",
      "\"Do you think that we start to see more investment in the market in 2024?\",",
      "\"Is there pressure for GPs to deploy so that there isn't so much dry powder?\",",
      "\"Anything interesting coming up that you would like to announce for Sak Ventures whether that be something that LPs would like to know, Founders would like to know, folks who want to become an investor at Sak Ventures?\"]"
    ]
  },
  "gVA9HBKCRxg": {
    "title": "This is Kevin Moore - Serac Ventures",
    "channel": "This Is Oklahoma",
    "date": "2025-01-07",
    "questions": [
      "[\"What leads you to donate to positive tomorrows over all of the other amazing Charities that we have in Oklahoma City and around the nation?\", \"Take me to Tulsa growing up then, what's that like?\", \"Where does that voice come from and that awareness at that young age to be like oh no from this this moment I'm going to get straight A I'm going to get my head down because your situation could have gone you know you could it would have been easier of you to go the other way statistically?\"]",
      "1. \"Going back to you being getting the scholarships applying for scholarships what's the reason that you choose to go into mechanical engineering when you're a kid?\"",
      "2. \"You're pretty good at math and art then right?\"",
      "3. \"What leads you to pick up a pencil when you're a kid drawing artwork and and I mean what style and and fascination with art do you dive into?\"",
      "4. \"What are the other goals you're working on at the moment?\"",
      "5. \"How do you fight that Comfort because a lot of people and I struggle with this too cuz you know I just you know yeah you have a house you have a car you take the box you're a member of the country club or you have kids or whatever whatever those social things that you goals that you get to there comes a point where you get and you're just like why get up at 4:30 I'm like this is good enough yeah like what is in you in your own words I guess that keeps you going and fights that Comfort because I don't I think people probably listening struggle with it too right they just they get to a certain State you know thing they let their health go a little bit they've got some money in the bank now they bought the car that they want to drive like you know they're now they're not continuing to do those five minute things every day to continue they might learn a different language or to push themselves to keep going they get lazy and might get fat and whatever it is like everyone seems to do that at a certain point in their career doesn't sound like you've done that yet?\"",
      "[\"Where did the idea come for for for you the inclusion and everything and the opportunity you see and then also where do you find the name for it as well?\", \"Where does that come from?\", \"What was the when you take yourself back to reading Finance in the library and reading all those books did you think at that moment I want to be in a finance I want to have a financial company?\", \"Was that a moment or was it I mean later on you're just like I want to know Finance because I've never been taught this and it's not something I?\", \"When did this company stop?\", \"Do you still read quite a lot today?\", \"What are you reading right now?\", \"Do you do any guess speaking?\", \"Define guest speaking?\", \"Looking back at my own life right my own grandparents and my parents like you know thankfully I still have time with my parents with my grandparents I interviewed my granddad I didn't interview my grandmother or my grand um but I interviewed my granddad and it's the greatest thing I've done I think for the family like you know cuz we have that right but you know it's so easy to do with an iPhone just set up right but it's people to your to your point have to you you had to get over that you had to cuz cuz like you said you know and that's you know everybody has a story like yours very few people have a story like yours which makes your story very compelling um you know but we just don't the old generation isn't they're not storytellers they weren't like they they were taught to keep things in keep their head down grind you know put food on the table like they weren't thinking I have a podcast I have this like it's on their radar yeah we live in this Society now where there's like this people Embrace more openness but it might be because it's so much much easier to reach people so people don't really show the authentic side of themselves cuz they like oh why do I need to do that I can move on to the next thing so for me it was and you know I still feel not like super comfortable doing it but I've gotten it's easier to do to realize our stories are about who make us who we are they make us who we are and we shouldn't be ashamed of it we should just embrace it and move on yeah finishing up um I know we we're going to do this again because I love where you're going and and want to do this you know with a catch up in kind of 3 to five years and see where everything's going um 20 there's there's a great guest on the podcast and a guy named Colonel Stanley Evans who plans his life in 20 years St and he's like who am I going to be in 20 years right kind of like what you do you break it down daily you know the whole eatting an one by at a time but it's great to when most people do the three to 5 year thing and the 10 year thing but when you look at 20 years you know you're going to be 64 years old and 20 years looking back as a 64y old what are the things that you want your 64 year old to be proud of and tell you?\", \"What was your High School?\", \"If you were to wave the magic wand and build your dream house what's your dream house what does it look like what are the non-negotiables of things you must have in your dream house?\"]"
    ]
  },
  "ZmZUtIES8HE": {
    "title": "The Path from LP to GP with Kevin Moore of Serac Ventures",
    "channel": "Valor Ventures",
    "date": "2024-04-23",
    "questions": [
      "[\"I would just love to hear you take us down the path from from LP to GP?\", \"I would love to get more context on a thesis of Sak right?\", \"So when you you know were thinking about starting sarak, how did you go about crafting this thesis to fit within the ecosystem?\", \"What did you see missing in the capital stack and and how did you think about SX differentiation?\", \"When you think about the traditional kind of stock market and how people are were in that during the pandemic and now they're transitioning into to unique things gold um stocks or whatever it may be, so as you kind of think about that what you know what what part of the capital stack relative to venture are you focused on?\", \"Is it seed, is it preed, series a, any geography bounds?\", \"Tell us more about that?\"]",
      "[\"I'm curious to hear you know at sarak you and Daryl and the broader team how are you all thinking about AI in terms of specific verticals that you're interested in whether it be along the future of work or unique ways that you want to or are thinking about deploying AI internally at Sak?\",",
      "\"How are you from a high level dilen in AI opportunities that come across your table often times these deals are are pretty hot you know they're moving quickly um at least there's a lot of fomo created around the opportunity from the founder perspective but how do you all how do you all think about diligen in in AI opportunity that comes across your desk that you're interested in but you're not sure H is this actually proprietary or not?\",",
      "\"I want to shift back to you know your time as an LP a little bit right you you spent time there I think for five or six years or so and curious to hear how you developed Frameworks around decision-making from investing in funds to saying hey this is a red flag I should double check with the general partner or the specific Venture Capital firm or whatever asset it was at this time about this or I should ask them these questions?\",",
      "\"How do LPS sort of think about alignment with the prospective funds that they want to invest in from you know a thesis perspective and and also how do they build conviction around emerging managers at fund one and and fund two any Frameworks that you can provide for us around around that Insight?\"]",
      "[\"I actually been thinking about this question a lot especially in the last two or three years but I've just been so many emerging managers come to Market and the difficulty that LP's fac with making the decision of is this the right one that I'm going to back?\", \"Maybe you can walk us through you know a couple of those deals that you all have done already and and why you had conviction in the team or or opportunity in in Tam as well?\", \"Why is Sak in in Oklahoma and and what advantage do you have of being kind of centrally located in the country when it comes to to to deal flow?\", \"How can a Founder who's listening to this conversation get in touch with you? Is there a form on your website or or anything like that?\"]"
    ]
  },
  "mMGtsZzJ6Eg": {
    "title": "Grow Where You&#39;re Planted: Building Serac Ventures with Kevin Moore | Alone Together | S1E1",
    "channel": "Mike Ma",
    "date": "2025-03-05",
    "questions": [
      "[\"What in God's name led you in your life to this part?\", \"Can you connect your like why you picked this area into what your Kevin Moore the person was and why these lines are so important for you between your personal life and your investing life?\", \"Can you just double click a little bit to set up the rest of the conversation on St ventures, your thesis and what you're interested in investing in?\", \"Will you do coastal deals?\", \"What are some of the things that make the solo model worthwhile for you?\", \"What has been the most rewarding and maybe also most challenging parts of going it alone?\", \"What are some of the tips that you have about being a solo GP?\"]",
      "[\"How do you know it's worked well in the beginning?\", \"How did you know when you were ready?\", \"Can you give me or the listeners some broad contours of how to think about what readiness looks like amongst this and other axes?\", \"How can I ask how you're using it today?\", \"How do we as VCs integrate that in our practice for finding LPs or finding Founders or building visibility among other VCs?\", \"How do you use technology to enable you to do that faster?\", \"How do you use this technology to enhance what we're doing to go deeper faster?\"]",
      "[\"Can you say a little bit about that strategy?\", \"Can you say more about that because like look the objection is like oh my God these checks aren't going to be big enough uh you know I have a 25 million cover on my fund I don't know what your I I forgot what yours is but 30 million 30 Milli like can you get there?\", \"What's your answer to that like so when we first when I when we sort of made this decision to start doing that we were sort of hovering and stuck at a number then when we say all right we're going to double down for the next six months just to test this thesis and then our largest investor is here they put in a $5 million check and a lot of it had to do with just doubling down on what we're doing here spending more time with them different things and for a $30 million fund a $5 million check is a is a really big deal congrats yeah so that reinforced this idea of man we just need to really grow where we're planted but philosophically the extension of that also pertains to our portfolio companies where we just backed a company in Birmingham Alabama and these guys are harnessing uh their talent and Technology to serve a a base of customers right in their Community had no one is thinking about and it just resonates with me to be like man these guys are growing where they're planted planted and this technology has enabled them to build this amazing business and access customers that uh need what they're doing but if these guys were thinking oh we're in Birmingham we need to start competing for customers in New York and San Francisco and Chicago they probably wouldn't be doing as good as they are so now I look at it as concentric circles both for Founders like them and for firms like ours we need to strengthen and do the best that what we have with where we are and then as we grow we can start expanding the circle of our LPS regionally then nationally and then ultimately as we're raising bigger funds internationally and that's how I think about the evolution of Sak LPS ask us well tell us about what you're trying to do fund three and four it's like well for fund one I think that the majority of our support is going to come from around here fund two and so forth it's going to expand but to raise a venture like a scalable firm you kind of have to build build your a solid foundation and then grow from there but I think a lot of emerging managers start to focus on the outer concentric Rings before really building that solid foundation right where they are guilty I mean guilty like and so so count me in that group I I want to I mean like I want to ask about this 5 million dollar anchor without know like but like do they invest because you're going to have an an Oklahoma City thesis or was it just like all the work you put in validated the the the grower planted you just put in the Reps and they're like look we get it we've der risked enough we've watched you we have fer you be in Oklahoma City but if not we you know we're just backing you because of your T how and then how did that ladder with these I mean for me my individual checks you know kind of like the 2500k range I like pick these off one at a time how did you balance both the to use since you played basketball the inside game and the outside game?\", \"How close have you ever been to getting hit by a bus?\", \"What's your response to that objection to solo GPS if you even bother to Levy one?\", \"Give me your ideal solo GP date?\", \"What is your typical response to being a solo GP?\", \"What would be your walk up?\"]"
    ]
  },
  "OyOClHpmXAs": {
    "title": "The Power of Personal Storytelling in Venture Capital w/ Kevin Moore of Serac Ventures",
    "channel": "Unlocking Venture Capital",
    "date": "2024-09-02",
    "questions": [
      "[\"how are you doing Kevin?\", \"Kevin please tell us about uh about yourself and about sarak and what your focus is high level?\", \"I was wondering if there is a reason that uh that you guys are are headquartered there um or if that's just kind of how everything kind of came about in your life?\", \"how do founders get to know and understand and how to work with this Guild Network and do they have to currently be in your portfolio company already?\", \"I was wondering what kind of things and learnings did you experience from when you actually made that leap that you know you kind of wish you knew then that I think a lot of our listeners would be so interested to know?\", \"as you are kind of going through that first fundraising stage that first you know incorporation of your fund and everything was there a pivotal moment where you had this moment of realization did something was there like an event that that happened or something that somebody had said um in your environment that really sunk in for sure?\"]",
      "[\"What is that going to do with whoever is receiving that, you know what I mean?\", \"Can you share with us an example of someone who has that trait, that founder of yours that you've talked to recently or they were one of the founders that you've invested in?\", \"Can I quantify this?\", \"How can I utilize your skill set for good?\", \"Where are the opportunities on the edges where there's some sort of asymmetric advantage that founders give or something that you're doing for investors?\", \"Why are you making a certain type of decision?\"]",
      "[\"Why did you want to be a venture capitalist?\", \"How do you bring out what a founder needs when they don't know what help they need?\", \"Are there any red flags that are immediate disqualifiers for you?\", \"Do you have automatic disqualifiers that you have come across in your first fund?\", \"What does 'it's about the founder' really mean to you?\", \"How do other investors explain 'it's about the founder' in a general sense?\", \"What are those principles that guide you to stay in your lane?\"]"
    ]
  },
  "mZFn1fw-BIM": {
    "title": "Kevin Moore:  Serac Ventures:   Being on Both Sides of the Table",
    "channel": "The Investor with Joel Palathinkal",
    "date": "2023-11-02",
    "questions": [
      "No questions were asked to the guest in this transcript segment.",
      "The transcript segment does not contain any questions."
    ]
  },
  "65Ex8XR7rJI": {
    "title": "Early-Stage VC with Kevin Moore, Founder of Serac Ventures - Strategic Growth Podcast Ep194",
    "channel": "The Golding Group Business Growth Consulting",
    "date": "2024-05-22",
    "questions": [
      "[\"Can you help me with meeting a VC?\", \"Can you give people the two minute version of your background and what you've been doing leading up to your role at SRA?\", \"What do I need to do to do X, Y, or Z?\", \"How do you see the industry as over overall business in Oklahoma and the influence of venture capital?\", \"Where do you think we're going from 2025 on if we continue at the same pace of expansion of adding more Venture Capital firms in Oklahoma?\", \"Do you see it the same way?\", \"Can you explain early stage investing?\"]",
      "[\"Are there particular verticals that you guys like to invest in and ones that you avoid?\", \"Are you invested in in businesses in in both of those Metro areas?\", \"What do you think of that program and how do you think that that effect is going to benefit not just Tulsa but the whole state of Oklahoma probably the Midwest?\", \"Do you wonder though Kyle if as some of these tech companies and others who were huge proponents of virtual work and requesting that people come back into the office could that impact negatively Tulsa remote and other programs like that?\", \"What's your take on how the state putting kind of their money where their mouth was back in the day to to to form ite now of course they have ples Ventures that's that's doing their fun how do you think now that that that that ripple effect has happened do how much success do are we seeing at VC in 2024 comes from the fact that it has been around for 20 something years now?\"]",
      "[\"What was it like working going to work for ite like coming from banking from being you know being something that was more on the traditional side to something more now on Avenger Capital side?\",",
      "\"How I I get in the Venture from there cuz you know a lot of people would think maybe working at the FED is like would be the the the job right?\",",
      "\"Speaking of background just growing up like uh where did you grow up and what kind of what kind of kid were you?\",",
      "\"Tell everyone about your book starting your own Venture investment fund?\",",
      "\"How to how to get through the Sak and make it to the top of the mountain did I do that right?\"]"
    ]
  },
  "pVA8HBJ27Qs": {
    "title": "The Secrets to Building a Winning Investment Strategy with Kevin Moore",
    "channel": "Open People Network",
    "date": "2025-04-02",
    "questions": [
      "[\"Is there something there that you could say, you know, I took these learnings and they've really impacted how I work with founders, how I work with people?\", \"Is it that every founder you work with is just gang busters for numbers, or it's the complete opposite and you tend to be pushing them more on how to uh report and share back information to uh to other GPS and LPS and their and their investments?\", \"Can you share a little bit about why this is so crucial to a founder when they're building their company?\"]",
      "[\"So if you can justify it and everybody else can believe in the way you've justified it, then people will want to invest because they will also believe the world is flat or the world is going to blow up in the next 5 years because you've created such an argument that it's almost inevitable that this will happen?\",",
      "\"So is there a criteria that you look at today and did it shift from 10 years ago because your learning's changed?\",",
      "\"Are you refining your process and saying, 'No, I don't like these founders. They keep failing.'?\",",
      "\"So, I'm not looking for the uh the blonde hair brush cut guys anymore. They're not doing it. So, I'm going after the med school uh PhDs. like have you kind of continued to refine your KPIs and your metrics just as a founder should when they're out pitching for for money or for pitching in general?\",",
      "\"What is the fear of a startup sharing this information to their investors?\",",
      "\"Um, do you have any ways that you work with founders to get them to be more alerted to the fact that this will benefit them to share out um and get this off their chest and do it on a regular basis?\",",
      "\"Have you actually talked to the the end customer to figure out what they want?\",",
      "\"You haven't went literally went to their office, sat down with them and collected this data?\",",
      "\"Why did you start your company?\",",
      "\"What are the expectations?\",",
      "\"And then what are the roles that venture fits into helping companies, angels, LPs, venture people?\",",
      "\"What are their roles in helping these companies actually achieve these goals?\",",
      "\"Like where do you see that um the fit there?\",",
      "\"What's the recommendation?\",",
      "\"What's the best way for my money to be successful?\",",
      "\"How do you kind of validate through all of that?\"]",
      "[\"So, is there a chapter? Is there a section of the book that you would move to the front, make it bigger, or is there a section you would say, you know what, I wish I put this in when I do version two of the book. I'm going to add in this new area because you've got eight, seven and eight years of learning from when you started writing to when you published to where you are today. Is there a section that you would add more to it or that you would put in a new chapter and say, you know what, I learned a lot about this. I'm going to do a whole subject just on governance and boards. Like, is there something that you would say you would add in?\", \"So, how do you manage all of this? because I think it is a one-hit wonder to your point and you have to just take it as in honestly it's it's just luck because this isn't a stock market portfolio construction. This is literally a hit and miss and the risk is so high that the success is very low. But we'll take it as it comes.\", \"What is your worst investment and your favorite investment or the same?\", \"Do you have any references to podcasts or other areas that you collect information from that you think would be useful to founders or investors?\", \"What is your superpower?\"]"
    ]
  },
  "Wv1tIxg--Ek": {
    "title": "#101 Zaka Presents My Journey Kevin Moore",
    "channel": "Zaka",
    "date": "2023-09-29",
    "questions": [
      "[\"Could you just let us know a little bit more about your cultural background and where you grew up?\", \"What were some of the lessons that you learned as in your childhood that kind of helped you today?\", \"What were like some of the few challenges that you had to deal with as in your childhood that kind of shape you professionally in your journey?\", \"What was like some of your aspirations as a child like growing up?\", \"What was it like after graduating from Oklahoma State?\", \"What would like some of those struggles you face after you like your education like trying to identify your career path?\", \"What helps you get through that?\", \"What kept you motivated to keep moving forward?\"]",
      "[\"Does that make sense?\", \"Can you explain a little bit more about what a VC does and how to help Founders?\", \"How do you successfully navigate on the landscape and finding those individuals and those Partnerships?\", \"Was that something I came about when you were a financial advisor at Morgan Stanley and I know you were at Northwestern Mutual as well did those days influence you?\", \"How did you leverage your civil engineering degree to then move into that Financial role?\", \"Can you speak a little bit more on the lack of diversity in the VC world and the lack of minority Founders getting investment opportunities?\"]",
      "[\"Given that you have a wide aperture for accepting what was once a completely closed off group of Founders, how are you even handling the amount of deal flow that you're getting?\",",
      "\"Could you tell us a little bit more about like how your cultural background could provide you with distinct insight that potentially an investor would kind of overlook at some point?\",",
      "\"Do you allow people to come back?\",",
      "\"How do you stay adaptable and forward thinking especially considering technology and all these market trends?\",",
      "\"Could you talk about a moment that led you to establish your business?\",",
      "\"If there's any words that you could share with aspiring immigrant entrepreneurs who are looking to start their journey or maybe even start a unique path in the finance industry, what would you share with them?\"]"
    ]
  },
  "MPaUKa6-JO8": {
    "title": "Investing Against the Grain",
    "channel": "Swimming with Allocators",
    "date": "2025-05-14",
    "questions": [
      "[\"So uh would love to first start with Roslin uh if you could share your backgrounds and how you got to this point.\", \"But if you put that on um were there any lessons during like as you were learning you know you had some experience in directly investing and then you know how was it learning about how to invest in funds and what were you looking for at the time?\", \"How do you actually determine if someone has streamlined operations?\", \"Roslin, you you start you you brought up Twiggo, which I'm I'm glad I have a lot of friends who've gone through that program and it's it's had, you know, made waves in all aspects of of finance. But I was curious, you know, as you then started your career as an allocator, what um were there any specific kind of like experiences or or lessons that have really shaped how you your perspective on investing in the managers?\", \"That kind of leads to my next question, uh, for you, Robin. You decided to, you're a builder, uh, just like Kevin, and decided to start your own firm. With those kind of lessons in mind, how did you make sure that like your firm, what was the inspiration to start your firm, and what how did you make sure your firm incorporated all those lessons from your career?\", \"And Kevin, what was the inspiration to start your firm when you've had a successful, you know, career as, you know, both an LP, co-investor, all those things?\", \"Have you found, you know, for you, Kevin, interesting ways to be able to convey that yourself versus also, were there things that you found found when you were an allocator as ways for people to really show that when it's not the most obvious?\"]",
      "[\"Why can't you find it?\", \"How, you know, how does a a a firm like yours help navigate fund managers and all these different things?\", \"Are are you all seeing um any you know changes uh over the last 12 months in the fund terms and governance structures that LPs are looking for?\", \"What was it about Kevin and that you saw that you were like, I want to invest and partner with what he's building, even if it's an asset class that I'm not as familiar with?\", \"So, how do you think our emerging managers should think about convincing people who are either sour on the asset class from recent kind of like indicators or who have don't have much experience in the asset class at all?\"]",
      "[\"What do you think allocators today should be doing differently in a market where there's literally so much change?\", \"What trends do you see in venture capital in 2025 and beyond? And, you know, are you overly optimistic or bearish on it over these next this next decade?\", \"How do you develop and cultivate strong relationships with allocators and LPs um when there's so much noise today? So many more firms.\", \"How do you actually differentiate yourself and more importantly how do you have these strong relationships?\"]"
    ]
  }
}